{"meta":{"title":"Summer News","subtitle":"孙夏的博客 | Summer Sun's blog","description":null,"author":"Summer Sun","url":"http://yoursite.com"},"pages":[],"posts":[{"title":"老司机带带我 | Graduate School Hello World","slug":"first-day-zju","date":"2016-09-11T01:46:39.000Z","updated":"2016-09-11T08:18:29.429Z","comments":true,"path":"2016/09/11/first-day-zju/","link":"","permalink":"http://yoursite.com/2016/09/11/first-day-zju/","excerpt":"","text":"今天正式注册开始了研究生的学业。浑浑噩噩地过了大学四年，没有信心找到好工作申到好学校，就选择了继续读书，至今也不知道这个坑入得对不对。 接下来将近三年的日子里，虽然没了几年前的牛逼哄哄的梦想，但也要按部就班踏踏实实地做自己要做的事情。也不知道老板还会安排我做些什么，牙齿还是多维体数据还是什么其它的？谁晓得呢。既然来了CAD，许多热门的东西就难以接触了，很多东西也不是我能选择的了。只希望自己： 锻炼身体，提升形象; 多留些时间做些提升自己的东西，尤其是对自己专业发展有利的； 实验室的项目能研究地深入一点，不能简单地完成任务，争取发点文章专利； 总结做的点点滴滴，吸收碎片化的知识。 Summer加油！Summer牛逼！@杭州 English version:I have just registered for my graduate study this morning. As a fucking mediocre student, I still have no idea whether it’s correct for me to further my graduate study. Hope I could do every thing step by step in the next 2.5 years.I don’t have that much freedom for my graduate study &amp; projects, I just hope I could: Improve my body and appearance physically; Spare more time for those things that could benefit my future career; Step deeper in my lab study instead of simply finishing tasks, try to do some papers and patents; Collect and absorb every fragment knowledge I meet in my study and life. All the best Summer!@Hangzhou","categories":[],"tags":[{"name":"碎碎念","slug":"碎碎念","permalink":"http://yoursite.com/tags/碎碎念/"}],"keywords":[]},{"title":"Hello World","slug":"hello-world","date":"2016-09-09T16:14:32.068Z","updated":"2016-09-09T16:14:32.068Z","comments":true,"path":"2016/09/10/hello-world/","link":"","permalink":"http://yoursite.com/2016/09/10/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[],"keywords":[]}]}